[
{"Description": "This innovative program awards a degree level qualification largely based on recognition of professionalpractice.", "Title": "Professional Practice: ", "What experience is required": "Deakin University offers admission to postgraduate courses through a number of Admission categories.In all categories of admission, selection is based primarily on academic merit as indicated by an applicants previous academic record.<strong>Graduate Certificate</strong>At least 5 years of relevant professional experience in information technology.<strong>Master</strong> - Bachelor degree in any discipline AND at least 5 years of relevant professional experience in information technology - <strong>or</strong> Graduate Certificate of Professional Practice (Information Technology)For more information on the Admission Criteria and Selection Policy visit \"https://policy.deakin.edu.au/view.current.php?id=00034\"", "Graduate Certificate Programs": "2 programs", "What are the benefits": "Learn when you want by watching videos, reading articles, doing tests, and completing assignments onlineJoin online discussions and collaborate with your peers in a virtual study groupEnjoy discussions with feedback from expert educatorsGet full access to the university library, online resources and support", "Why join this degree": "The credentials and the assessment project (capstone) are completed directly with Deakin University 4 Deakin Credentials (AUD 495 each) + 2 FutureLearn Programs (AUD 3285 each) = GCPP IT (AUD 8550 total) 10 Deakin Credentials (AUD 495 each) + 2 FutureLearn Programs (AUD 3285 each) + Deakin Capstone (AUD 6570) = MPP IT (AUD 18090 total)"},
{"Description": "Expand your experience and get re-skilled or re-trained in computing with one of Deakins Information Technologydegrees", "Title": "Information Technology", "What experience is required": "Deakin University offers admission to postgraduate courses through a number of Admission categories.In all categories of admission, selection is based primarily on academic merit as indicated by an applicants previous academic record.<strong>Graduate Certificate</strong>For more information on the Admission Criteria and Selection Policy visit \"https://policy.deakin.edu.au/view.current.php?id=00034\"", "Graduate Certificate Programs": "4 programs", "What are the benefits": "Learn when you want by watching videos, reading articles, doing tests, and completing assignments onlineJoin online discussions and collaborate with your peers in a virtual study groupEnjoy discussions with feedback from expert educatorsGet full access to the university library, online resources and support", "Why join this degree": "Developed in consultation with industry, these degrees will teach you how information technologies relate to everyday business operations within organisations. Youll also gain essential IT skills, from software design and engineering to information retrieval and web development.You will gain the essential skills and knowledge for employment across a range of industries and prepares you for further studies in IT.Deakin University offers admission to postgraduate courses through a number of Admission categories.In all categories of admission, selection is based primarily on academic merit as indicated by an applicants previous academic record."},
{"Description": "Professional Practice: Leadership is an innovative program that awards a degree level qualification largely based on recognition of professionalpractice.", "Title": "Professional ", "What experience is required": "Deakin University offers admission to postgraduate courses through a number of Admission categories.In all categories of admission, selection is based primarily on academic merit as indicated by an applicants previous academic record.Minimum entry requirements: at least five years of relevant professional experience*OR an Associate Degree and 3 years relevant work experience**full-time (or equivalent part-time) managerial, leadership in innovative or entrepreneurial business or ventures or equivalentFor more information on the Admission Criteria and Selection Policy visit \"https://policy.deakin.edu.au/view.current.php?id=00034\"", "Graduate Certificate Programs": "2 programs", "What are the benefits": "Learn when you want by watching videos, reading articles, doing tests, and completing assignments onlineJoin online discussions and collaborate with your peers in a virtual study groupEnjoy discussions with feedback from expert educatorsGet full access to the university library, online resources and support", "Why join this degree": "The credentials and the assessment project (capstone) are completed directly with Deakin. 4 Deakin Credentials (AUD 495 each) + 2 FutureLearn Programs (AUD 3375 each) = GCPP Leadership (AUD 8730 total) 10 Deakin Credentials (AUD 495 each) + 2 FutureLearn Programs (AUD 3375 each) + Deakin Capstone (AUD 6750) = MPP Leadership (AUD 18450 total)"},
{"Description": "By studying cyber security, youll have the skills needed by all companies today. Our courses are industry-specific, so you study issues important to business  like implementing security technologies to protect against hackers or credit cardfraud.", "Title": "Cyber Security", "What experience is required": "Deakin University offers admission to postgraduate courses through a number of Admission categories.In all categories of admission, selection is based primarily on academic merit as indicated by an applicants previous academic record.<strong>Graduate Certificate</strong>To be eligible for entry, applicants must have:<strong>Graduate Diploma</strong>To be eligible for entry, applicants must have:<strong>Master</strong>To be eligible for entry, applicants must have:For more information on the Admission Criteria and Selection Policy visit \"https://policy.deakin.edu.au/view.current.php?id=00034\"", "Graduate Certificate Programs": "4 programs", "What are the benefits": "Learn when you want by watching videos, reading articles, doing tests, and completing assignments onlineJoin online discussions and collaborate with your peers in a virtual study groupEnjoy discussions with feedback from expert educatorsGet full access to the university library, online resources and support", "Why join this degree": "Through a Cyber Security degree, youll learn how to confront cyber security - one of the 21st Centurys most critical issues.Focusing on a range of studies, youll gain knowledge from system security and digital forensics to analytics and organisational security.These degrees give you the cyber security skills that are crucial to the success of our digital future. And, once you graduate, youll have the knowledge and talent to take on an expert security role within business, government or law enforcement."},
{"Description": "Cultivate the skills and the knowledge required in responding to national and international emergencies by studying a humanitarian assistancecourse.", "Title": "Development and ", "What experience is required": "Deakin University offers admission to postgraduate courses through a number of Admission categories. In all categories of admission, selection is based primarily on academic merit as indicated by an applicants previous academic record.To be eligible for admission to this program, all applicants must also meet the \"http://www.deakin.edu.au/international-students/getting-into-deakin/entry-requirements/english-language-requirements/postgraduate-requirements\">minimum English language requirements</a>.To be eligible for entry into the Graduate Certificate, Graduate Diploma or Master of Development and Humanitarian Action applicants require:For more information on the Admission Criteria and Selection Policy visit \"https://policy.deakin.edu.au/view.current.php?id=00034\">the guide</a>.", "Graduate Certificate Programs": "4 programs", "What are the benefits": "Learn when you want by watching videos, reading articles, doing tests, and completing assignments onlineJoin online discussions and collaborate with your peers in a virtual study groupEnjoy discussions with feedback from expert educatorsGet full access to the university library, online resources and support", "Why join this degree": "These degrees  developed in association with Save the Children  build a unique, global platform where development & humanitarian practitioners and academics can share knowledge and experience, with a focus on improving leadership, preparedness and response capacities to national and international emergencies and developmental issues.Deakins degrees in Development and Humanitarian Action provide you with the analytical skills needed to understand the contexts of development and humanitarian programs as well as practical skills to apply in the field.Deakin University offers admission to postgraduate courses through a number of Admission categories. In all categories of admission, selection is based primarily on academic merit as indicated by an applicants previous academic record."},
{"Description": "This degree qualifies you as a health professional with a focus on reducing the prevalence and impact of this growing threat to human lives. It is accredited by the Australia Diabetes EducatorsAssociation.", "Title": "Diabetes Education", "What experience is required": "Deakin University offers admission to postgraduate courses through a number of Admission categories.In all categories of admission, selection is based primarily on academic merit as indicated by an applicants previous academic record.Applicants for the course must be appropriately qualified and currently registered professionals with a health science background, including registered nurses, dietitians, podiatrists, pharmacists, exercise physiologists and general practitioners.Applicants should have at least two years experience working in their chosen field since undergraduate course completion. In order to undertake the placement component of this course students must be one of the ADEA listed CDE eligible professions, with current registration to practice as such (eg AHPRA).If you hold a tertiary health related degree in another area (for example in psychology, social work etc) you are still able to undertake and complete your Graduate Certificate of Diabetes Education at Deakin, but you may not be eligible to become a credentialed diabetes educator.For further information, please visit the \"https://www.google.co.uk/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=1&amp;cad=rja&amp;uact=8&amp;ved=0ahUKEwjd4s3K2qPSAhXpAMAKHct_DkEQFggcMAA&amp;url=https://www.adea.com.au/credentialling/credentialled-diabetes-educators/&amp;usg=AFQjCNGmwM03oCbB2zcu6ly7I2uWfjDt1g\">ADEA Being a Credentialled Diabetes Educator website.</a>For more information on the Admission Criteria and Selection Policy visit \"https://policy.deakin.edu.au/view.current.php?id=00034\"", "Graduate Certificate Programs": "4 programs", "What are the benefits": "Learn when you want by watching videos, reading articles, doing tests, and completing assignments onlineJoin online discussions and collaborate with your peers in a virtual study groupEnjoy discussions with feedback from expert educatorsGet full access to the university library, online resources and support", "Why join this degree": "This degree qualifies you as a health professional with a focus on reducing the prevalence and impact of this growing threat to human lives.Youll learn about the anatomy, physiology and pathology of the disease, its sociocultural and psychological effects, as well as techniques for effective management and prevention through education to become a qualified and in-demand health professional.Deakin University offers admission to postgraduate courses through a number of Admission categories.In all categories of admission, selection is based primarily on academic merit as indicated by an applicants previous academic record."},
{"Description": "Careers in property and real estate are vast. Our property and real-estate programs are renowned for high graduate employability, industry relevance and offering of a global industryperspective.", "Title": "Property and ", "What experience is required": "To be eligible for entry, applicants must have:Selection is based primarily on academic merit, as indicated by an applicants previous academic record.", "Graduate Certificate Programs": "4 programs", "What are the benefits": "Learn when you want by watching videos, reading articles, doing tests, and completing assignments onlineJoin online discussions and collaborate with your peers in a virtual study groupEnjoy discussions with feedback from expert educatorsGet full access to the university library, online resources and support", "Why join this degree": "Boost your existing property knowledge with expertise in valuation and property development, or get the qualifications you need to start a new career in the property industry. This degree will prepare you for a range of roles including property development, property management and valuation.Property graduates are in high demand and employment opportunities exist in a range of areas. Sold?To be eligible for entry, applicants must have:"}
]