[
{"Title": "Business and ", "Number": "8 courses", "Description": "Develop your fundamental business and finance skills, with the prospect of earning 30 credits towards a Business Management BA, with this flexible program of online courses from The Open University BusinessSchool."},
{"Title": "Business Fundamentals", "Number": "4 courses", "Description": "Develop your communication, networking, relationship building and project management skills with this flexible program of online courses from The Open University BusinessSchool."},
{"Title": "Causes of ", "Number": "5 courses", "Description": "Explore what causes human disease, through this flexible program of online courses. Earn 10 credits from the University ofLeeds."},
{"Title": "Discovering Science", "Number": "5 courses", "Description": "Discover the fascinating world of everyday chemistry and earn 10 credits from the University ofLeeds."},
{"Title": "Environmental Challenges", "Number": "5 courses", "Description": "Change how you think about the environment, by exploring how human society interacts with the natural world, through this flexible program of online courses. Earn 10 credits from the University ofLeeds."},
{"Title": "Finance Fundamentals ", "Number": "4 courses", "Description": "Develop your understanding of financial planning, budgeting, borrowing and investments with this flexible program of online courses from The Open University BusinessSchool."},
{"Title": "Foundations of University Learning ", "Number": "3 courses", "Description": "Master the elements of teaching and learning in higher education with a flexible program of three online courses from UNSWSydney."},
{"Title": "Genomics ", "Number": "3 courses", "Description": "Gain insight into the role of genomic technologies across the breadth of medicine, with this flexible program of online courses from St Georges, University ofLondon."},
{"Title": "Good Brain, ", "Number": "3 courses", "Description": "Explore the key concepts of the human brain with this flexible program of online courses from the University ofBirmingham."},
{"Title": "Introducing Robotics", "Number": "3 courses", "Description": "The world needs people who understand robotics. Get started with this flexible and practical program of online courses from Queensland University ofTechnology."},
{"Title": "Management ", "Number": "2 courses", "Description": "Take your first step to becoming a Chartered Manager with this flexible program of online courses from The Open University Business School andCMI."},
{"Title": "Mergers ", "Number": "5 courses", "Description": "Explore the world of mergers and acquisitions, from theory to structuring deals to accounting, with this flexibleprogram."},
{"Title": "Online ", "Number": "4 courses", "Description": "Gain the skills to launch, market and run your own online business with this program of online courses from successful entrepreneurs at RMITUniversity."},
{"Title": "Practical ", "Number": "3 courses", "Description": "Get a practical introduction to data mining using the popular Wekaworkbench."},
{"Title": "Robotic Vision", "Number": "3 courses", "Description": "Gain the skills to build a computer vision system in this practical program of onlinecourses."},
{"Title": "Social Enterprise", "Number": "3 courses", "Description": "Understand what it takes to launch and run a sustainable social enterprise with this flexible program of online courses from Middlesex University BusinessSchool."},
{"Title": "STEM Teaching", "Number": "3 courses", "Description": "Master different elements of STEM teaching - Assessment for Learning, Differentiating for Learning and Managing Behaviour for Learning - with this flexible program of online courses from the National STEM LearningCentre."},
{"Title": "Teaching for Success: Practices for English ", "Number": "3 courses", "Description": "Understand and plan your professional development as an English language teacher, with this flexible program of online courses from the British Council, looking at the 12 professional practices from its CPDFramework."},
{"Title": "Teaching ", "Number": "3 courses", "Description": "Learn how to improve science lessons for 14-16 year olds, with this flexible program of teaching courses perfect forCPD."},
{"Title": "The ", "Number": "4 courses", "Description": "Develop the business, management and marketing skills to thrive in the digital economy and take your first steps towards an MBA, with this flexible program of online courses from The Open University BusinessSchool."},
{"Title": "Using Food as Medicine in ", "Number": "5 courses", "Description": "Develop practical skills in the areas of food and nutrition with this program of courses for healthcareprofessionals."}
]